Revit 2027 API
ParameterTypeId.NumberSystemOrientation Property
 "Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NumberSystemOrientation { get; }
Public Shared ReadOnly Property NumberSystemOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NumberSystemOrientation {
	ForgeTypeId^ get ();
}
static member NumberSystemOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace